[
  {
    "id": 1,
    "monthDate": "0523",
    "author": "Everyone",
    "date": "28/05/2023",
    "thumbnail": "./photos/shoppingList.jpg",
    "description": "We went to the library and discussed what we need to do for parts pickups",
    "content": "we discussed some things for our planning to develop our robot. we assembled a kind of shopping list: <img class='imageInLog' src='./photos/shoppingList.jpg'/>" 
  },
  {
    "id": 2,
    "monthDate": "0823",
    "author": "Aaron",
    "date": "01/08/2023",
    "description": "Aaron got some insight on how we could design the drivetrain",
    "content": "Currently we have two different but similar drivetrain designs. Both involve a plan of six wheels where the four outside wheels are drivers and the two in the middle are flexwheel idlers. This is to provide a level of cushioning when our robot needs to roll over the pipe barrier in the middle of the field. Our plans revolve on wether or not to have the four driver wheels be powered by four individual motors, or by two motos that are hooked up to the 4 wheels by a sprocket or gear system. Please refer to the September 1st log entry for more information about our drivetrain."
  },
  {
    "id": 3,
    "monthDate": "0923",
    "author": "Aaron & Veer",
    "date": "01/09/2023",
    "thumbnail": "./photos/image1.png",
    "description": "Me and Aaron as well as other members discussed specifics of the drivetrain",
    "content": "Me and Aaron presented to the team some ideas about how we could design the drive train as mentioned in August 1st's log entry. Eventually we decided on a concept that uses crossing tails to allow our robot to move over the side and middle bars easily. We also encountered a problem we might have. As you can see in the following image flex wheels come in sizes 2, 3, and 4 inches in diameter whereas omni-directional wheels come in sizes 3.25 and 4 inches.</br></br><img class='imageInLog' src='./photos/image1.png'/></br></br>The problem we have with the wheel sizes is that if we have a wheel that is smaller than the other wheels, say a 3.25 inch omni wheel and a 3 inch flex wheel, we would need to either move the omni wheel up a qaurter inch or the flex wheel down a quarter inch. Perhaps we could make it so that the center wheels are using the red(100rpm) gearboxes to provide more torque when crossing the middle bar. We also decided that we would be using blue(600 rpm) gearboxes to maximize speed as our robot is going to be designed as an offensive robot. Other things Aaron wanted me to mention in this log is that this robot will have a low center of mass to prevent the robot from flipping when it makes abrupt stops."
  },
  {
    "id": 4,
    "monthDate": "1023",
    "author": "Whole Team",
    "date": "20/10/2023",
    "thumbnail": "./photos/motorConfig.pngs",
    "description": "Started building the drive train. We have changed the configuration of the motors.",
    "content": "First of all we decided to not go with flex wheels in between two omni wheels. We are also using a smaller omniwheel size for six wheels. To make it run more efficiently and not burn out our motors we have geared the 6 wheels together on their respective sides. As we plan on using blue gearboxes this will lengthen the time for the motors to overheat. We also changed our motor configuration. Unlike the the plan in the September 1st log entry, two of the motors are stacked ontop of each other and geared to the wheels. This allowed us to make space for an intake and also provide a support for a future catapult to move triballs to the other side of the arena.<br/><img class='imageInLog' src='./photos/motorConfig.png'/><br/><img class='imageInLog' src='./photos/wheelGearing.png'/><br/> $ \\text{let } In_1 \\text{ be the motor 1 input} $ <br/> $ \\text{let } In_2 \\text{ be the motor 2 input} $ <br/> $ \\text{let } In_3 \\text{ be the motor 3 input} $ </br> $ In_1, In_2, In_3 = 600\\text{ rpm} $ <br/> We have three motors per side. The gear ratio for $ In_1\\text{ and }In_2 $ is 36T:60T and for $ In_3 $ the gear ratio is 36T:36T:60T which is just 36T:60T(See Image 2 above for details). Assuming that each input  corresponds to one output we can say that wheel 1 is out 1, wheel 2 is out 2, and wheel 3 is out 3. <br/> $ \\therefore Out_n=In_n*\\frac{6}{10} $ <br/> rpm is not an SI unit so we convert to Hz: <br/> $ Out_n=In_n*\\frac{6}{10}*\\frac{1\\text{ min}}{60\\text{ sec}} $ <br/> Factoring we get: </br> $ Out_n=In_n*\\frac{6}{600} $ <br/> $ Out_n=In_n*\\frac{1}{100} $ <br/> $ Out_n=\\frac{In_n}{100} $ </br> Testing this with <a href='https://www.convertunits.com/from/RPM/to/hertz'>https://www.convertunits.com/from/RPM/to/hertz</a> and inputing 360 becauce $ 600*\\frac{6}{10}=360 $. According to the website the expected value should be 6 Hz. Now we try our formula: <br/> $ Out_n=\\frac{In_n}{100} $<br/> $ Out_n=\\frac{600\\text{ rpm}}{100} $<br/>$ Out_n=6\\text{ Hz} $ <br/> This matches with the result we got from the website. <br/> $ \\therefore Out_1, Out_2, Out_3 = 6\\text{ Hz} $ <br/> As We had said before, each output is a wheel and we now know each wheel rotates 6 times per second. From here we can find the tangential velocity of each wheel by finding the period of the wheel first. <br/> $ T=\\frac{1}{f} $ <br/> $ T=\\frac{1}{6\\text{ Hz}} = 0.1\\overline{666}\\text{ sec} = 0.1667\\text{ sec} $ <br/> Before we can calculate the tangential velocity we need to convert our radius from inches to centimeters. The diamete is 3.25 inches so the radius is 1.625 inches. Converting to centimeters: $ r=1.625\\text{ inches}*2.54=4.1275\\text{ cm} $ <br/> Now we have period and radius we can calculate tangential velocity: <br/> $ \\vec{v}=\\frac{2\\pi r}{T} $ <br/> $\\vec{v}=\\frac{2\\pi*\\left(4.1275\\text{ cm}*\\frac{1\\text{ m}}{100\\text{ cm}}\\right)}{0.1667\\text{ sec}} $ <br/> $ \\vec{v}=1.555719697\\text{ m/s} $ <br/> We picked this orientation of motors because it gives us an automatic ramp that is nice and shallow for our future intake and catapult systems. As we said at the start of this logbook we geared the wheels together to lessen the impacts of the heat when using the blue gearboxes. This will allow us to extract the maximum amount of speed available for longer times because it takes longer for the motors to be throttled due to overheating." 
  }
    ]

